app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
    def index
        # render json: "hi"
        render json: Movie.all

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        puts params
        render json: Movie.find(params[:id])

INSERT INTO "movies" ("title", "year", "poster_url") VALUES ($1, $2, $3) RETURNING "id"
---
    def create
        movie = Movie.new(movie_params)

        if movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "movies" SET "title" = $1 WHERE "movies"."id" = $2  [["title", "\"Nightmare Before Christmas\""], ["id", 5]]
---
    def update
        movie = Movie.find(params[:id])
        movie.update(movie_params)

DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 6]]
---
    def destroy
        movie = Movie.destroy(params[:id])